joristork/robots/jobot_in_c/microchip_extras/h/p18lf26k22.h
extern volatile near unsigned char       IPR3;
extern volatile near struct {
  unsigned TMR1GIP:1;
  unsigned TMR3GIP:1;
  unsigned TMR5GIP:1;
  unsigned CTMUIP:1;
  unsigned TX2IP:1;
  unsigned RC2IP:1;
  unsigned BCL2IP:1;
  unsigned SSP2IP:1;
} IPR3bits;
extern volatile near unsigned char       EECON1;
extern volatile near struct {
  unsigned RD:1;
  unsigned WR:1;
  unsigned WREN:1;
  unsigned WRERR:1;
  unsigned FREE:1;
  unsigned :1;
  unsigned CFGS:1;
  unsigned EEPGD:1;
} EECON1bits;
extern volatile near unsigned char       EECON2;
extern volatile near unsigned char       EEDATA;
extern volatile near unsigned char       EEADR;
extern volatile near union {
  struct {
    unsigned EEADR:8;
  };
  struct {
    unsigned EEADR0:1;
    unsigned EEADR1:1;
    unsigned EEADR2:1;
    unsigned EEADR3:1;
    unsigned EEADR4:1;
    unsigned EEADR5:1;
    unsigned EEADR6:1;
    unsigned EEADR7:1;
  };
} EEADRbits;
extern volatile near unsigned char       EEADRH;
extern volatile near union {
  struct {
    unsigned EEADRH:2;
  };
  struct {
    unsigned EEADR8:1;
    unsigned EEADR9:1;
  };
} EEADRHbits;
extern volatile near unsigned char       RC1STA;
extern volatile near union {
  struct {
    unsigned RX9D:1;
    unsigned OERR:1;
    unsigned FERR:1;
    unsigned ADDEN:1;
    unsigned CREN:1;
    unsigned SREN:1;
    unsigned RX9:1;
    unsigned SPEN:1;
  };
  struct {
    unsigned :3;
    unsigned ADEN:1;
  };
  struct {
    unsigned RX9D1:1;
    unsigned OERR1:1;
    unsigned FERR1:1;
    unsigned ADDEN1:1;
    unsigned CREN1:1;
    unsigned SREN1:1;
    unsigned RX91:1;
    unsigned SPEN1:1;
  };
} RC1STAbits;
extern volatile near unsigned char       RCSTA;
extern volatile near union {
  struct {
    unsigned RX9D:1;
    unsigned OERR:1;
    unsigned FERR:1;
    unsigned ADDEN:1;
    unsigned CREN:1;
    unsigned SREN:1;
    unsigned RX9:1;
    unsigned SPEN:1;
  };
  struct {
    unsigned :3;
    unsigned ADEN:1;
  };
  struct {
    unsigned RX9D1:1;
    unsigned OERR1:1;
    unsigned FERR1:1;
    unsigned ADDEN1:1;
    unsigned CREN1:1;
    unsigned SREN1:1;
    unsigned RX91:1;
    unsigned SPEN1:1;
  };
} RCSTAbits;
extern volatile near unsigned char       RCSTA1;
extern volatile near union {
  struct {
    unsigned RX9D:1;
    unsigned OERR:1;
    unsigned FERR:1;
    unsigned ADDEN:1;
    unsigned CREN:1;
    unsigned SREN:1;
    unsigned RX9:1;
    unsigned SPEN:1;
  };
  struct {
    unsigned :3;
    unsigned ADEN:1;
  };
  struct {
    unsigned RX9D1:1;
    unsigned OERR1:1;
    unsigned FERR1:1;
    unsigned ADDEN1:1;
    unsigned CREN1:1;
    unsigned SREN1:1;
    unsigned RX91:1;
    unsigned SPEN1:1;
  };
} RCSTA1bits;
extern volatile near unsigned char       TX1STA;
extern volatile near union {
  struct {
    unsigned TX9D:1;
    unsigned TRMT:1;
    unsigned BRGH:1;
    unsigned SENDB:1;
    unsigned SYNC:1;
    unsigned TXEN:1;
    unsigned TX9:1;
    unsigned CSRC:1;
  };
  struct {
    unsigned TX9D1:1;
    unsigned TRMT1:1;
    unsigned BRGH1:1;
    unsigned SENDB1:1;
    unsigned SYNC1:1;
    unsigned TXEN1:1;
    unsigned TX91:1;
    unsigned CSRC1:1;
  };
} TX1STAbits;
extern volatile near unsigned char       TXSTA;
extern volatile near union {
  struct {
    unsigned TX9D:1;
    unsigned TRMT:1;
    unsigned BRGH:1;
    unsigned SENDB:1;
    unsigned SYNC:1;
    unsigned TXEN:1;
    unsigned TX9:1;
    unsigned CSRC:1;
  };
  struct {
    unsigned TX9D1:1;
    unsigned TRMT1:1;
    unsigned BRGH1:1;
    unsigned SENDB1:1;
    unsigned SYNC1:1;
    unsigned TXEN1:1;
    unsigned TX91:1;
    unsigned CSRC1:1;
  };
} TXSTAbits;
extern volatile near unsigned char       TXSTA1;
extern volatile near union {
  struct {
    unsigned TX9D:1;
    unsigned TRMT:1;
    unsigned BRGH:1;
    unsigned SENDB:1;
    unsigned SYNC:1;
    unsigned TXEN:1;
    unsigned TX9:1;
    unsigned CSRC:1;
  };
  struct {
    unsigned TX9D1:1;
    unsigned TRMT1:1;
    unsigned BRGH1:1;
    unsigned SENDB1:1;
    unsigned SYNC1:1;
    unsigned TXEN1:1;
    unsigned TX91:1;
    unsigned CSRC1:1;
  };
} TXSTA1bits;
extern volatile near unsigned char       TX1REG;
extern volatile near union {
  struct {
    unsigned TX1REG:8;
  };
  struct {
    unsigned TXREG:8;
  };
} TX1REGbits;
extern volatile near unsigned char       TXREG;
extern volatile near union {
  struct {
    unsigned TX1REG:8;
  };
  struct {
    unsigned TXREG:8;
  };
} TXREGbits;
extern volatile near unsigned char       TXREG1;
extern volatile near union {
  struct {
    unsigned TX1REG:8;
  };
  struct {
    unsigned TXREG:8;
  };
} TXREG1bits;
extern volatile near unsigned char       RC1REG;
extern volatile near union {
  struct {
    unsigned RC1REG:8;
  };
  struct {
    unsigned RCREG:8;
  };
} RC1REGbits;
extern volatile near unsigned char       RCREG;
extern volatile near union {
  struct {
    unsigned RC1REG:8;
  };
  struct {
    unsigned RCREG:8;
  };
} RCREGbits;
extern volatile near unsigned char       RCREG1;
extern volatile near union {
  struct {
    unsigned RC1REG:8;
  };
  struct {
    unsigned RCREG:8;
  };
} RCREG1bits;
extern volatile near unsigned char       SP1BRG;
extern volatile near union {
  struct {
    unsigned SP1BRG:8;
  };
  struct {
    unsigned SPBRG:8;
  };
} SP1BRGbits;
extern volatile near unsigned char       SPBRG;
extern volatile near union {
  struct {
    unsigned SP1BRG:8;
  };
  struct {
    unsigned SPBRG:8;
  };
} SPBRGbits;
extern volatile near unsigned char       SPBRG1;
extern volatile near union {
  struct {
    unsigned SP1BRG:8;
  };
  struct {
    unsigned SPBRG:8;
  };
} SPBRG1bits;
extern volatile near unsigned char       SP1BRGH;
extern volatile near union {
  struct {
    unsigned SP1BRGH:8;
  };
  struct {
    unsigned SPBRGH:8;
  };
} SP1BRGHbits;
extern volatile near unsigned char       SPBRGH;
extern volatile near union {
  struct {
    unsigned SP1BRGH:8;
  };
  struct {
    unsigned SPBRGH:8;
  };
} SPBRGHbits;
